app/Controllers/BarangController.php

    public function index()
    {
        $data['barang'] = $this->barangModel->getAllBarang();
        $data['kategori'] = $this->kategoriModel->findAll();
        $data['lokasi'] = $this->lokasiModel->findAll();
---
SELECT *
FROM `kategori`
SELECT *
FROM `lokasi`

    public function create()
    {
        $data['kategori'] = $this->kategoriModel->findAll();
        $data['lokasi'] = $this->lokasiModel->findAll();
---
SELECT *
FROM `kategori`
SELECT *
FROM `lokasi`

    public function store()
    {
        // Validasi input
        $validation = $this->validate([
            'nama_barang' => 'required|min_length[3]|max_length[100]',
            'id_kategori' => 'required|integer',
            'id_lokasi'   => 'required|integer',
            'stok'         => 'required|integer',
            'deskripsi'    => 'permit_empty|max_length[255]'
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan data ke database
        $this->barangModel->save([
            'nama_barang' => $this->request->getPost('nama_barang'),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'id_lokasi'   => $this->request->getPost('id_lokasi'),
            'stok'         => $this->request->getPost('stok'),
            'deskripsi'    => $this->request->getPost('deskripsi')
        ]);
---
INSERT INTO `barang` (`nama_barang`, `id_kategori`, `id_lokasi`, `stok`, `deskripsi`) VALUES ('Kayu Mahoni', '1', '2', '23', 'untuk membuat joglo')

    public function edit($id)
    {
        // Ambil data barang yang ingin diedit
        $data['barang'] = $this->barangModel->find($id);

        if (!$data['barang']) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Barang tidak ditemukan');
        }

        // Ambil data kategori dan lokasi
        $data['kategori'] = $this->kategoriModel->findAll();
        $data['lokasi'] = $this->lokasiModel->findAll();
---
SELECT *
FROM `kategori`
SELECT *
FROM `lokasi`

    public function update($id)
    {
        // Validasi input
        $validation = $this->validate([
            'nama_barang' => 'required|min_length[3]|max_length[100]',
            'id_kategori' => 'required|integer',
            'id_lokasi'   => 'required|integer',
            'stok'         => 'required|integer',
            'deskripsi'    => 'permit_empty|max_length[255]'
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Update data barang
        $this->barangModel->update($id, [
            'nama_barang' => $this->request->getPost('nama_barang'),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'id_lokasi'   => $this->request->getPost('id_lokasi'),
            'stok'         => $this->request->getPost('stok'),
            'deskripsi'    => $this->request->getPost('deskripsi')
        ]);
---
UPDATE `barang` SET `nama_barang` = 'Kayu Mahoni', `id_kategori` = '1', `id_lokasi` = '2', `stok` = '23', `deskripsi` = 'untuk membuat joglo di desa'
WHERE `barang`.`id_barang` IN ('8')