app/Controllers/LokasiController.php

    public function store()
    {
        $validation = $this->validate([
            'nama_lokasi' => 'required|min_length[3]|max_length[100]',
            'deskripsi'   => 'permit_empty|max_length[255]'
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->lokasiModel->save([
            'nama_lokasi' => $this->request->getPost('nama_lokasi'),
            'deskripsi'   => $this->request->getPost('deskripsi')
        ]);
---
INSERT INTO `lokasi` (`nama_lokasi`, `deskripsi`) VALUES ('sasa', 'sasa')

    public function update($id)
    {
        $validation = $this->validate([
            'nama_lokasi' => 'required|min_length[3]|max_length[100]',
            'deskripsi'   => 'permit_empty|max_length[255]'
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->lokasiModel->update($id, [
            'nama_lokasi' => $this->request->getPost('nama_lokasi'),
            'deskripsi'   => $this->request->getPost('deskripsi')
        ]);
---
UPDATE `lokasi` SET `nama_lokasi` = 'sasa', `deskripsi` = 'sasaa'
WHERE `lokasi`.`id_lokasi` IN ('6')