app/Models/BarangModel.php

SELECT `barang`.*, `kategori`.`nama_kategori`, `lokasi`.`nama_lokasi`
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
JOIN `lokasi` ON `lokasi`.`id_lokasi` = `barang`.`id_lokasi`
---
    public function getAllBarang()
    {
        return $this->select('barang.*, kategori.nama_kategori, lokasi.nama_lokasi')
                    ->join('kategori', 'kategori.id_kategori = barang.id_kategori')
                    ->join('lokasi', 'lokasi.id_lokasi = barang.id_lokasi')
                    ->findAll();