app/Models/KategoriModel.php

    public function getAllKategori()
    {
        return $this->findAll();
---
SELECT *
FROM `kategori`