app/Models/LokasiModel.php

SELECT *
FROM `lokasi`
---
    public function getAllLokasi()
    {
        return $this->findAll();